# RebarSystemHookOrientFrontDirn2 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarSystemHookOrientFrontDirn2 Property
ParameterTypeId Class See Also
---
"Exterior Minor Hook Orientation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemHookOrientFrontDirn2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemHookOrientFrontDirn2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemHookOrientFrontDirn2 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace